tap "aws/tap"
tap "benjiwolff/neovim-nightly"
tap "d12frosted/emacs-plus"
brew "zstd"
brew "autossh"
brew "aws-sso-cli"
brew "openssl@3"
brew "awscli"
brew "bat"
brew "bob"
brew "chezmoi"
brew "cmake"
brew "dotnet", link: false
brew "eza"
brew "fd"
brew "fzf"
brew "gmp"
brew "gcc"
brew "gnupg"
brew "go"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libvterm"
brew "libyaml"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "mise"
brew "mole"
brew "mysql"
brew "mysql-client"
brew "pandoc"
brew "pipx"
brew "prettier"
brew "pyenv"
brew "ripgrep"
brew "rust"
brew "sesh"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "uv"
brew "yazi"
brew "z"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "aws/tap/copilot-cli"
cask "balenaetcher"
cask "beyond-compare"
cask "bitwarden"
cask "codex"
cask "codex-app"
cask "docker-desktop"
cask "dotnet-sdk"
cask "d12frosted/emacs-plus/emacs-plus-app"
cask "font-alegreya"
cask "font-blex-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-sf-pro"
cask "ghostty"
cask "google-chrome"
cask "gstreamer-runtime"
cask "iterm2"
cask "lm-studio"
cask "ngrok"
cask "notion"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "zed"
cask "zoom"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
cargo "csharp-language-server"
uv "basedpyright"
